# Импортируем Router — контейнер для обработчиков сообщений
from aiogram import Router

# Импортируем Message — объект входящего сообщения
from aiogram.types import Message

# Импортируем фильтр Command — ловит команды (/start)
from aiogram.filters import Command

# Импортируем нашу inline-клавиатуру главного меню
from app.keyboards.inline_menu import get_main_inline_menu


# Создаём router для этого модуля
router = Router()


# Этот обработчик срабатывает при команде /start
@router.message(Command("start"))
async def start_handler(message: Message):
    """
    Обработчик команды /start.
    Отправляет приветствие
    и показывает inline-меню.
    """

    # Отправляем сообщение с inline-кнопками
    await message.answer(
        # Текст сообщения
        "Привет! 👋\n\n"
        "Это Ixora Bot.\n"
        "Выберите действие:",

        # Передаём inline-клавиатуру
        reply_markup=get_main_inline_menu()
    )
